{
    "term": "library",
    "part-of-speech": "ainmfhocal",
    "citation-form": "leabharlann (chóid)",
    "def-en": "A collection of standardised code that is put together to help with other coding projects, and that is (typically) available publicly and for free.",
    "def-ga": "Cnuasach cóid caighdeánach a chuirtear le chéile chun cuidiú le tionscadail chóid eile, agus atá ar fáil (den chuid is mó) go poiblí agus saor in aisce.",

    "prov": {
        "leabharlann": "de-bhaldraithe, dineen, focloir-beag, odonaill",
        "cód": "de-bhaldraithe, dineen*, focloir-beag, odonaill"
    },
    "notes": [
        "* tá an focal 'cód' i bhFoclóir Uí Dhuinín, ach is le brí 'a code, a codex, a book' atá sé luaite. Ní dócha go rabhthas ag trácht ar cód ríomhaireachta sa bhFoclóir sin, toisc é a bheith níos sine, agus aidhm níos ginearálta (seachas teicniúil) a bheith aige.",
        "Luann na foclóirí eile 'cód' le brí comhchiallach le 'code' ríomhaireachta.",
        "Is trí analach a cruthaíodh an téarma Béarla 'library', toisc leabharlann chóid a bheith úsáidte mar chnuasach cóid caighdeánach a bhfuil rochtain go forleathan (agus saor in aisce) air chun córais ríomhaireachta a fhorbairt. Ní droch-analach é sin -- agus ní bhraitheann sé ar choir chainte an Bhéarla ach ar choincheap teibí. Glactar leis mar sin.",
        "Cuirtear an focal 'cód' leis seo (.i. 'leabharlann chóid', seachas 'leabharlann') toisc nach bhfuil an úsáid seo an-choitianta i nGaeilge, agus toisc gur léire é mar théarma leis an sainmhíniú sin. Sin ráite, ní gá an focal 'cóid' a choinneáil leis más léir ón gcomhthéacs cad atá i gceist (agus go háirithe má tá an téarma 'leabharlann chóid' luaite cheana).",
        "Tá an-chathú le téarma a chumas as nua -- 'códlann'. Cé go bhfuil 'cód' agus '-lann' in úsáid go forleathan i nGaeilge, ní cainteoir dúchais mé, agus ní mhothóinn compordach téarma mar sin a chruthú nuair atá téarma eile (.i. 'leabharlann chóid') in ann an bhrí cheannann chéanna a chur in iúl gan focal ar leith a chruthú as nua."
    ]
}